--活动配置表

g_ActivityConfig = {
	ActivityItem={
		{
			Template="ActLevelVip",
			--OpenDate=20131011,
			--CloseDate=20131111,
			AutoHide=true,
			RequireLevel=1,
		},
		{
			Template="ActWisdomTree",
			AutoHide=true,
		},
		{
			Template="GoldChange",
			AutoHide=true,
		},
		{
			Template="ActGetEnergy",
			AutoHide=true,
		},
		{
			Template="ActLevelVip2",
			AutoHide=true,
		},
	},
	---------------等级送vip----------------
	LVLevelToReward = {
			--[1] = {[1]=大于等于5级,[2]={金钱类型，金钱数量，}，[3]={[1号物品]={物品id，物品类型，物品数量},...},[4]=vip,}
			[1] = {[1]=5,[2]={1,50,},[3]={[1]={27,4,2}},},
			[2] = {[1]=10,[2]={1,60,},[3]={[1]={8,4,3}},},
			[3] = {[1]=15,[2]={1,80,},[3]={},[4]=1,},
			[4] = {[1]=20,[2]={1,100,},[3]={[1]={10,4,1}},},
			[5] = {[1]=25,[2]={1,150,},[3]={},[4]=2,},
			[6] = {[1]=30,[2]={1,200,},[3]={[1]={25,4,1}},},
			},
	----------------------------------------
	
	---------------到时间领取体力----------------
	TETime = {[1]={12,13},[2]={18,19},},		--领取时间段，（6,12）
	TEEnergy = 75,
	----------------------------------------
	
	---------------钱币兑换:EG-兑换元宝 EM-兑换金币----------------
	ExchangeGoldCount =	{  1,  2,  3,  4,  5,},--兑换元宝,每日可换次数上限变换
	ExchangeGoldRate =	{0.4,0.5,0.6,0.8,  1,},--兑换元宝数量比例变化
	
	
	EGRefreshCD = 10,	--兑换元宝的刷新时间
	EGDefaultIndex = 1,	--默认兑换选项索引 EGGoldCfg[1]
	EGDefaultRate = 2,	--默认兑换汇率选项索引 EGExchangeRate[1]
	EGGoldCfg = {
			[1] = {22,21,},
			[2] = {24,21,},
			[3] = {26,21,},
			[4] = {28,21,},
			[5] = {30,11,},
			[6] = {32,5,},
			},
	EGExchangeRate = {
			[1] = {210,16,},
			[2] = {200,16,},
			[3] = {190,16,},
			[4] = {180,16,},
			[5] = {170,16,},
			[6] = {160,16,},
			[7] = {150,2,},
			[8] = {140,2,},
			},
	
	EMDailyCount = 5,
	EMRefreshCD = 5,
	EMDefaultIndex = 1,
	EMDefaultRate = 1,	
	EMMoneyCfg = {
			[1] = {5,10,},
			[2] = {6,10,},
			[3] = {7,10,},
			[4] = {8,20,},
			[5] = {9,20,},
			[6] = {10,20,},
			[7] = {11,8,},
			[8] = {12,2,},
			},
	EMExchangeRate = {
			[1] = {520,16,},
			[2] = {500,16,},
			[3] = {480,16,},
			[4] = {460,16,},
			[5] = {440,16,},
			[6] = {420,16,},
			[7] = {400,2,},
			[8] = {380,2,},
			},
	-------------------------------
}
